const mongoose = require('mongoose');
//mongoose.Promise = require('q').Promise;
let validator = require('validator');
const metadata_fields = require('./models/metadata_fields.model');

exports.generateFields = function (req, res, next) {



    const allNodesFromBottom = [];
    const root1 = new metadata_fields({
        "definition": "იდენტიფიკაცია",
        "label": "იდენტიფიკაცია",
        "note": "",
        "num": "1",
        "isRequired": "",
        "sample": "",
        "fieldType": "TREE_FIELD",
        "sort":1
    });



    const root1_immidiate_children =[];

    root1_immidiate_children.push(new metadata_fields({
        "definition": "დამახასიათებელი და ხშირად, უნიკალური, მარტივად იდენტიფიცირებადი სახელწოდება, რომელითაც ცნობილია რესურსი",
        "label": "რესურსის სახელწოდება",
        "note": "მონაცემთა რესურსს უნდა გააჩნდეს უნიკალური და ადვილად იდენტიფიცირებადი სახელწოდება. რესურსის დასახელების განსაზღვრისას მხედველობაში უნდა იქნას მიღებული პოტენციური მომხმარებლების მოთხოვნილებები. სახელწოდება უნდა იყოს ინფორმაციული და აქარწყლებდეს ერთი მონაცემის მეორესთან აღრევის რისკს. ძიების ზოგადი მექანიზმები ხშირად ახდენენ პირველი ჩანაწერის ანალიზს. შესაბამისად, სასურველია, რომ რესურსის დასახელება ნათლად განსაზღვრავდეს სივრცით მონაცემს და განასხვავებდეს ძიების მსგავს შედეგებს.",
        "num": "1.1",
        "isRequired": "1",
        "sample": "საქართველოს გეოგრაფიული ობიექტების სახელწოდებების რეესტრი",
        "fieldType": "TEXT_FIELD",
        "sort":2
    }));



    root1_immidiate_children.push(new metadata_fields({"definition": "აბრივიატურა, აკრონიმი, სხვა სახელწოდება ან რესურსის სახელწოდება უცხო ენაზე.",
        "label": "რესურსის ალტერნატიული სახელწოდება",
        "note": "საქართველოს გეოგრაფიული ობიექტების სახელწოდებების რეესტრში გამოყენებული დასახელება, რომელიც მთავარ სახელწოდებასთან და რესურსის ალტერნატიულ დასახელებასთან ერთად უზრუნველყოფს რესურსის იდენტიფიკაციას. აკრონიმები და აბრივიატურები არის რესურსის ძირითადი სახელწოდების გავრცელებული ალტერნატიული ფორმები.",
        "num": "1.2",
        "isRequired": "1",
        "sample": "1. გეოგრაფიული ობიექტების სახელწოდებები 2. GeoNames",
        "fieldType": "TEXT_FIELD_REPEATABLE",
        "sort":3
    }));


    root1_immidiate_children.push(new metadata_fields({  "definition": "რესურსის შინაარსის მოკლე, თხრობითი რეზიუმე.",
        "label": "რესურსის მოკლე მიმოხილვა",
        "note": "რესურსის მოკლე მიმოხილვა ემსახურება პოტენციური მომხმარებლისთვის მონაცემთა ბუნების შესახებ წარმოდგენის შექმნას. აღწერა უნდა იყოს სრულყოფილი და მოკლე. ტექსტის შედგენისას მხედველობაში უნდა იქნეს მიღებული პოტენციური მომხმარებლის ყველა მოთხოვნილება. სასურველია გამოყენებული იქნეს სიტყვები და გამოთქმები, რომელსაც მომხმარებელი მოელის, რომ იქნება ტექსტში მოცემული. პირველ წინადადებებს არსებითი მნიშვნელობა აქვს ძიების პროცესისთვის. ისინი უნდა იყოს გასაგები და დაწერილი მარტივი ენით, მათ უნდა ახლდეს შესაბამის რესურსთან დაკავშირებული დეტალები. რეკომენდებულია ნათლად იქნას აღწერილი მონაცემთა შეგროვების მეთოდი. არ არის რეკომენდებული, მიმოხილვა მოიცავდეს 3500-ზე მეტ სიმბოლოს (სივრცეების ჩათვლით).",
        "num": "1.3",
        "isRequired": "1",
        "sample": "ტოპონიმები მოიცავს საქართველოს ტერიტორიაზე არსებული გეოგრაფიული ობიექტების სახელწოდებებს ოფიციალური რუკებიდან და სხვა ოფიციალური წყაროებიდან. ტოპონიმებში აღწერილია დაახლოებით ოცამდე განსხვავებული ტიპის გეოგრაფიული ობიექტის სახელწოდებები ქართულ, ინგლისურ და ნაწილობრივ რუსულ ენებზე, მათ შორის არის: მთების, ქედების, მწვერვალების, უღელტეხილების, დაბლობების, ზეგნების, მაღლობების, ხეობების, მღვიმეების, ბუნების ძეგლების და სხვა ძირითადი გეოგრაფიული ობიექტების სახელწოდებები (1:50000 მასშტაბის შესაბამისად).",
        "fieldType": "TEXTAREA",
        "sort":2
    }));



    root1_immidiate_children.push(new metadata_fields({    "definition": "მეტამონაცემების საშუალებით აღწერილი რესურსის ტიპი.",
        "label": "რესურსის ტიპი",
        "note": "როგორც წესი, არსებობს მონაცემთა რესურსების უამრავი სახეობა. ეროვნული სივრცითი მონაცემების ინფრასტრუქტურისთვის, რესურსის ტიპის გათვალისწინებით, გამოიყოფა მონაცემთა შემდეგი ჯგუფები: სივრცით მონაცემთა ნაკრები, სივრიცით მონაცემთა ნაკრების სერია და სივრცითი მონაცემებთან დაკავშირებული ელექტრონული სერვისი. ეროვნული სივრცითი მონაცემების ინფრასტრუქტურისთვის არსებობს მეტამონაცემთა ორი XML მოდელი: მონაცემთა ნაკრებებისა და მონაცემთა ნაკრებების სერიების მოდელი და სივრცით მონაცემებთან დაკავშირებული ელექტრონული სერვისების მოდელები. მეტამონაცემების შესაბამისი მოდელის ასარჩევად საჭიროა სივრიცითი მონაცემების რესურსის ტიპის ცოდნა მანამ, სანამ მოხდება მეტამონაცემების შეყვანა.",
        "num": "1.4",
        "isRequired": "1",
        "sample": "მონაცემთა ნაკრები",
        "fieldType": "TEXT_FIELD",
        "sort":5
    }));


    root1_immidiate_children.push(new metadata_fields({
        "definition": "ინფორმაცია რესურსის სტატუსის შესახებ.",
        "label": "რესურსის სტატუსი",
        "note": "სტატუსი გამოიყენება ინფორმირებისთვის, იმის შესახებ, რომ მონაცემთა ნაკრებები, მონაცემთა ნაკრებების სერიები და ელექტრონული სერვისები იმყოფება დაგეგმილ სტატუსში, ვითარდება ან მიმდინარე პროცესშია. მონაცემთა ნაკრებების და მონაცემთა ნაკრებების სერიები შესაძლოა იმყოფებოდეს დასრულებულ სტატუსში. ზოგიერთი გეოგრაფიული თემისთვის შესაძლოა გამოყენებულ იქნას სტატუსი: ,,ისტორიული არქივი“.",
        "num": "1.5",
        "isRequired": "1",
        "sample": "დასრულებული",
        "fieldType": "SELECT_FIELD",
        "sort":6
    }));


    root1_immidiate_children.push(new metadata_fields({
        "definition": "რესურსის ფარგლებში გამოყენებული ენა (ენები).",
        "label": "რესურსის ენა",
        "note": "გამოიყენება მხოლოდ ენის სამსიმბოლოიანი ბიბლიოგრაფიული კოდები სტანდარტიზაციის საერთაშორისო ორგანიზაციის სტანდარტის - ISO 639-2-ის მიხედვით.",
        "num": "1.6",
        "isRequired": "1",
        "sample": "ქართული",
        "fieldType": "SELECT_FIELD_REPEATABLE",
        "sort":7
    }));

    root1_immidiate_children.push(new metadata_fields({
        "definition": "მნიშვნელობა - კოდი, რომელიც იძლევა რესურსის უნიკალური იდენტიფიკაციის საშუალებას.",
        "label": "რესურსის უნიკალური იდენტიფიკატორი",
        "note": "ელემენტი ემსახურება მონაცემთა რესურსის უნიკალურად იდენტიფიკაციას. ის სავალდებულო ელემენტია, რომელიც წარმოადგენს საიდენტიფიკაციო კოდს, რომელიც ახდენს სივრცითი რესურსის უნიკალურად იდენტიფიკაციას. რესურსის უნიკალური იდენტიფიკატორი განსაზღვრული უნდა იყოს რესურსზე პასუხისმგებელი ორგანიზაციის მიერ. რესურსის უნიკალური იდენტიფიკატორისთვის შესაძლოა გამოყენებულ იქნას რესურსის საერთო ლოკატორი (URL - Uniform Resource Locator) და რესურსის საერთო სახელწოდება (URN - Uniform Resource Name). URN-ის გამოყენება უფრო სასურველია, ვინაიდან იგი არ იცვლება მონაცემთა ლოკაციის ცვლილებასთან ერთად. შესაძლოა, აგრეთვე, გამოყენებული იქნას უნივერსალური უნიკალური იდენტიფიკატორი (UUID - Universally Unique Identifier). არსებული მონაცემთა ნაკრების, მონაცემთა ნაკრებების სერიებისა და მონაცემთა სერვისების URL შესაძლოა იქნას ასევე დოკუმენტირებული. თუ არ არის ხელმისაწვდომი ბმული მეტი ინფორმაციისთვის, შესაძლოა იქნას მითითებული ბმული საკონტაქტო პირთან. რესურსის უნიკალური იდენტიფიკატორი არ შეიძლება შეიცვალოს.",
        "num": "1.7",
        "isRequired": "1",
        "sample": "GE:NAPR:GeoNames:0001",
        "fieldType": "TEXT_FIELD",
        "sort":8
    }));


    root1_immidiate_children.push(new metadata_fields({
        "definition": "თუ წყვილი რესურსი იქნა იდენტიფიცირებული, იქ სადაც რელევანტურია, იქმნება სივრცითი მონაცემების ნაკრებ(ებ)ის სერვისის ბმული, რომელსაც გააჩნია რესურსის უნიკალური იდენტიფიკატორი.",
        "label": "წყვილი რესურსი",
        "note": "მეტამონაცემის ეს ელემენტი აკავშირებს სერვისს იმ მონაცემთა ნაკრებთან ან მონაცემთა ნაკრებების სერიებთან, რომლებზეც მუშაობს სერვისი. ის ემსახურება იმ მონაცემთა ნაკრების შესახებ ინფორმაციის უზრუნველყოფას, რომლის მეშვეობითაც ყალიბდება სერვისი. მონაცემთა ნაკრების რესურსის უნიკალური ლოკატორი (URL), რომლის მეშვეობით ყალიბდება სერვისი, შესაძლოა მითითებულ იქნას, როგორც რესურსის უნიკალური იდენტიფიკატორი (URI). ეს ელემენტი შესაძლოა იყოს რესურსის უნიკალური იდენტიფიკატორის ელემენტის იდენტური მონაცემთა იმ ნაკრებებისთვის, რომელთა მეშვეობით ყალიბდება აღნიშნული სერვისი.",
        "num": "1.8",
        "isRequired": "1",
        "sample": "http://napr.gov.ge/eng/csw?SERVICE=CSW&VERSION=2.0.2&",
        "fieldType": "TEXT_FIELD",
        "sort":9
    }));


    root1_immidiate_children.push(new metadata_fields({
        "definition": "",
        "label": "რესურსის ლოკატორი (ბმული)",
        "note": "",
        "num": "1.9",
        "isRequired": "",
        "sample": "",
        "fieldType": "TREE_FIELD_REPEATABLE",
        "sort":10
    }));

    root1_immidiate_children.push(new metadata_fields({
        "definition": "",
        "label": "რესურსის მიწოდება",
        "note": "",
        "num": "1.10",
        "isRequired": "",
        "sample": "",
        "fieldType": "TREE_FIELD_REPEATABLE_INSIDE",
        "sort":13

    }));

    const _1_9_children = [];
    _1_9_children .push(new metadata_fields({
        "definition": "ბმული, ლოკაცია (მისამართი) ონლაინ წვდომისთვის რესურსთან ან/და რესურსის შესახებ დამატებით ინფორმაციასთან, რომელიც წარმოდგენილია რესურსების უნიფიცირებული მაჩვენებლითან სხვა მსგავსი სქემით.",
        "label": "რესურსის ლოკატორი: მონაცემთა ნაკრებების და მონაცემთა ნაკრებების სერიებისთვის.",
        "note": "ელემენტი განსაზღვრავს მონაცემთა რესურსთან დაკავშირებული ვებ-გვერდის (URL) მისამართ(ებ)ს. თუ არ არსებობს ვებ-მისამართი, ბმული შესაძლოა უთითებდეს საკონტაქტო პირზე. თუ რესურსი ხელმისაწვდომია სერვისის მეშვეობით, ეს ელემენტი იქნება სერვისის მისამართი (URL). მაგალითად, უნდა მიეთითოს http://napr.gov.ge უნდა იქნას გამოყენებული მისამართის პრეფიქსი ('http://').",
        "num": "1.9.1",
        "isRequired": "1",
        "sample": "http://nv1.napr.gov.ge/geoserver/wms&version=1.3.0",
        "fieldType": "TEXT_FIELD",
        "sort":10
    }));

    _1_9_children .push(new metadata_fields({
        "definition": "რესურსთან დაკავშირებისას გამოყენებული პროტოკოლი.",
        "label": "რესურსის ლოკატორი: პროტოკოლი",
        "note": "",
        "num": "1.9.3",
        "isRequired": "1",
        "sample": "HTTP:OGC:WMS",
        "fieldType": "SELECT_FIELD_RECOMMENDED",
        "sort":11
    }));
    _1_9_children .push(new metadata_fields({
        "definition": "ონლაინ რესურსით სარგებლობისას შესრულებული ფუნქციის კოდი.",
        "label": "რესურსის ლოკატორი: ფუნქცია",
        "note": "",
        "num": "1.9.4",
        "isRequired": "1",
        "sample": "ჩამოტვირთვა",
        "fieldType": "TEXT_FIELD",
        "sort":12
    }));

    root1_immidiate_children[root1_immidiate_children.length-2].children = _1_9_children;

    const _1_10_children = [];

    _1_10_children.push(new metadata_fields({
        "definition": "მონაცემთა მიწოდების ფორმატის სახელწოდება.",
        "label": "რესურსის მიწოდება: ფორმატი",
        "note": "",
        "num": "1.10.1",
        "isRequired": "1",
        "sample": "შეიპ ფაილი (ESRI Shape file)",
        "fieldType": "TEXT_FIELD",
        "sort":14
    }));


    _1_10_children.push(new metadata_fields({
        "definition": "მონაცემთა მიწოდებისას გამოყენებული ფორმატის ვერსია.",
        "label": "რესურსის მიწოდება: ფორმატის ვერსია",
        "note": "",
        "num": "1.10.2",
        "isRequired": "1",
        "sample": "9.1",
        "fieldType": "TEXT_FIELD",
        "sort":15
    }));


    root1_immidiate_children[root1_immidiate_children.length-1].children = _1_10_children;

    root1.children = root1_immidiate_children;

    allNodesFromBottom.push(..._1_9_children);
    allNodesFromBottom.push(..._1_10_children)
    allNodesFromBottom.push(...root1_immidiate_children);
    allNodesFromBottom.push(root1);





    const root2 = new metadata_fields({
        "definition": "",
        "label": "სივრცითი მონაცემებისა და სერვისების კლასიფიკაცია",
        "note": "",
        "num": "2",
        "isRequired": "",
        "sample": "",
        "fieldType": "TREE_FIELD",
        "sort":16
    });
    const _2_1 = new metadata_fields({
        "definition": "ძირითადი კატეგორია წარმოადგენს მონაცემების კლასიფიკაციის მთავარ დონეს, რომელიც განაპირობებს სივრცითი მონაცემების რესურსების დაჯგუფებას და უზრუნველყოფს თემატიკაზე დაფუძნებული ძიების ფუნქციის განხორციელებას.",
        "label": "სივრცითი მონაცემების თემების ძირითადი კატეგორიები ISO-ს მიხედვით.",
        "note": "ეს ელემენტი არის ISO-ს სტანდარტული თემების კლასიფიკაციის ელემენტი, რომელიც განკუთვნილია სივრცითი მონაცემების დაჯგუფებისა და ძიების გამარტივებისთვის. წარმოადგენს სივრცითი მონაცემების თემების ზოგად კლასიფიკაციას, რომლის მეშვეობითად ხდება მათი კატეგორიზაცია. ძიების ფუნქციის შესასრულებლად გამოიყენება საკვანძო სიტყვები. ამ ელემენტის დომენის მნიშვნელობა არის შესაბამისობაში ISO 19115 სტანდარტთან.",
        "num": "2.1",
        "isRequired": "1",
        "sample": "ლოკაცია, მდებარეობა",
        "fieldType": "SELECT_FIELD_MULTIPLESELECTION",
        "sort":17
    });
    root2.children = [_2_1];

    allNodesFromBottom.push(...[_2_1,root2]);

    const root3 = new metadata_fields({
        "definition": "",
        "label": "საკვანძო სიტყვა",
        "note": "",
        "num": "3",
        "isRequired": "",
        "sample": "",
        "fieldType": "TREE_FIELD",
        "sort":18
    });
    const _3_1 = new metadata_fields({
        "definition": "",
        "label": "ეროვნული სივრცითი მონაცემების თემები",
        "note": "",
        "num": "3.1",
        "isRequired": "",
        "sample": "",
        "fieldType": "TREE_FIELD",
        "sort":19
    });
    const _3_1_children = [];
    _3_1_children.push(new metadata_fields({
        "definition": "საზოგადოდ, ფართოდ გავრცელებული სიტყვა (სიტყვები), ოფიციალური სიტყვა (სიტყვები) ან ფრაზა (ფრაზები), რომლებიც გამოიყენება ობიექტის ან მოვლენის აღსაწერად.",
        "label": "ეროვნული სივრცითი მონაცემების თემები: საკვანძო სიტყვა",
        "note": "",
        "num": "3.1.1",
        "isRequired": "1",
        "sample": "ტოპონიმები (გეოგრაფიული ობიექტების სახელწოდებები)",
        "fieldType": "SELECT_FIELD_MULTIPLESELECTION"
    }));
    _3_1_children.push(new metadata_fields({
        "definition": "საკვანძო სიტყვების ოფიციალურად რეგისტრირებული კატალოგის სახელწოდება.",
        "label": "ეროვნული სივრცითი მონაცემების თემების კატალოგი: სახელწოდება",
        "note": "",
        "num": "3.1.2",
        "isRequired": "1",
        "sample": "ეროვნული სივრცითი მონაცემების თემების კატალოგი, ვერსია 1.0",
        "fieldType": "TEXT_FIELD"
    }));
    _3_1_children.push(new metadata_fields({
        "definition": "საკვანძო სიტყვების ოფიციალურად რეგისტრირებული კატალოგის საცნობარო თარიღი.",
        "label": "ეროვნული სივრცითი მონაცემების თემების კატალოგი: თარიღი",
        "note": "თარიღი განისაზღვრება სსტ ისო 19108:2002/2014 და სსტ ისო 8601:2004/2014 სტანდარტებით.",
        "num": "3.1.3",
        "isRequired": "1",
        "sample": "2007-09; 2015-04-25",
        "fieldType": "TIME_FIELD_FULL"
    }));
    _3_1_children.push(new metadata_fields({
        "definition": "მოვლენა, რომელიც აღწერს საცნობარო თარიღს.",
        "label": "ეროვნული სივრცითი მონაცემების თემების კატალოგი: თარიღის ტიპი",
        "note": "",
        "num": "3.1.4",
        "isRequired": "1",
        "sample": "გამოქვეყნება",
        "fieldType": "SELECT_FIELD"
    }));
    _3_1.children = _3_1_children;


    const _3_2 = new metadata_fields({
        "definition": "",
        "label": "GEMET-INSPIRE თემები",
        "note": "",
        "num": "3.2",
        "isRequired": "",
        "sample": "",
        "fieldType": "TREE_FIELD"
    });

    const _3_2_children = [];
    _3_2_children.push(new metadata_fields({
        "definition": "საზოგადოდ, ფართოდ გავრცელებული სიტყვა (სიტყვები), ოფიციალური სიტყვა (სიტყვები) ან ფრაზა (ფრაზები), რომელიც გამოიყენება ობიექტის ან მოვლენის აღსაწერად.",
        "label": "GEMET- INSPIRE თემები: საკვანძო სიტყვა",
        "note": "",
        "num": "3.2.1",
        "isRequired": "1",
        "sample": "შენობები",
        "fieldType": "SELECT_FIELD_MULTIPLESELECTION"
    }));
    _3_2_children.push(new metadata_fields({
        "definition": "საკვანძო სიტყვების ოფიციალურად რეგისტრირებული ცნობარის (თეზაურუსი) სახელწოდება.",
        "label": "GEMET- INSPIRE თემები: სახელწოდება",
        "note": "",
        "num": "3.2.2",
        "isRequired": "1",
        "sample": "GEMET – INSPIRE თემები, ვერსია 1.0",
        "fieldType": "TEXT_FIELD"
    }));
    _3_2_children.push(new metadata_fields({
        "definition": "საკვანძო სიტყვების ოფიციალურად რეგისტრირებული ცნობარის (თეზაურუსი)საცნობარო თარიღი.",
        "label": "GEMET- INSPIRE თემები: თარიღი",
        "note": "თარიღი განისაზღვრება სსტ ისო 19108:2002/2014 და სსტ ისო 8601:2004/2014 სტანდარტებით.",
        "num": "3.2.3",
        "isRequired": "1",
        "sample": "2007-09; 2015-04-25",
        "fieldType": "TIME_FIELD_FULL"
    }));
    _3_2_children.push(new metadata_fields({
        "definition": "მოვლენა, რომელიც აღწერს საცნობარო თარიღს.",
        "label": "GEMET- INSPIRE თემები: თარიღის ტიპი",
        "note": "",
        "num": "3.2.4",
        "isRequired": "1",
        "sample": "გამოქვეყნება",
        "fieldType": "SELECT_FIELD"
    }));

    _3_2.children = _3_2_children;

    const _3_4 = new metadata_fields({
        "definition": "მომხმარებლის მიერ განმარტებული სხვა საკვანძო სიტყვა.",
        "label": "თავისუფალი საკვანძო სიტყვა",
        "note": "",
        "num": "3.4",
        "isRequired": "1",
        "sample": "ტოპონიმი",
        "fieldType": "SELECT_FIELD_REPEATABLE"
    });
    root3.children = [_3_1, _3_2, _3_4];

    allNodesFromBottom.push(..._3_1_children);
    allNodesFromBottom.push(..._3_2_children);
    allNodesFromBottom.push(...[_3_1, _3_2, _3_4]);
    allNodesFromBottom.push(root3);





    const root4 = new metadata_fields({
        "definition": "",
        "label": "სივრცითი რეფერენცირება",
        "note": "",
        "num": "4",
        "isRequired": "",
        "sample": "",
        "fieldType": "TREE_FIELD"
    });

    const _4_1 = new metadata_fields({
        "definition": "",
        "label": "საკოორდინატო სარეფერენციო სისტემა",
        "note": "",
        "num": "4.1",
        "isRequired": "",
        "sample": "",
        "fieldType": "TREE_FIELD"
    });
    const _4_1_1 = new metadata_fields({
        "definition": "მონაცემთა რესურსის ერთიანი საკოორდინატო სარეფერენციო სისტემის ვალიდური კოდი.",
        "label": "საკოორდინატო სარეფერენციო სისტემა: კოდი",
        "note": "",
        "num": "4.1.1",
        "isRequired": "1",
        "sample": "EPSG::32638",
        "fieldType": "SELECT_FIELD_RECOMMENDED"
    });
    const _4_1_2 = new metadata_fields({
        "definition": "მონაცემთა რესურსის ერთიანი საკოორდინატო სარეფერენციო სისტემის კოდის სივრცე.",
        "label": "საკოორდინატო სარეფერენციო სისტემა: კოდის სივრცე",
        "note": "",
        "num": "4.1.2",
        "isRequired": "1",
        "sample": "EPSG",
        "fieldType": "SELECT_FIELD_RECOMMENDED"
    });

    _4_1.children = [_4_1_1, _4_1_2];



    const _4_2 = new metadata_fields({
        "definition": "",
        "label": "ვერტიკალური დატუმი",
        "note": "",
        "num": "4.2",
        "isRequired": "",
        "sample": "",
        "fieldType": "TREE_FIELD"
    });
    const _4_2_1 = new metadata_fields({
        "definition": "ინფორმაცია იმ ვერტიკალური საკოორდინატო სარეფერენციო სისტემის კოდის შესახებ, რომელშიც იზომება ზღვის დონიდან სიმაღლის მინიმალური და მაქსიმალური მნიშვნელობები.",
        "label": "ვერტიკალური დატუმი: კოდი",
        "note": "",
        "num": "4.2.1",
        "isRequired": "0",
        "sample": "EPSG::5105",
        "fieldType": "SELECT_FIELD_RECOMMENDED"
    });
    const _4_2_2 = new metadata_fields({
        "definition": "ინფორმაცია იმ ვერტიკალური საკოორდინატო სარეფერენციო სისტემის კოდის სივრცის შესახებ, რომელშიც იზომება ზღვის დონიდან სიმაღლის მინიმალური და მაქსიმალური მნიშვნელობები.",
        "label": "ვერტიკალური დატუმი: კოდის სივრცე",
        "note": "",
        "num": "4.2.2",
        "isRequired": "0",
        "sample": "EPSG",
        "fieldType": "SELECT_FIELD_RECOMMENDED"
    });
    _4_2.children = [_4_2_1, _4_2_2];

    root4.children = [_4_1, _4_2];


    allNodesFromBottom.push(...[_4_1_1, _4_1_2]);
    allNodesFromBottom.push(...[_4_2_1, _4_2_2]);
    allNodesFromBottom.push(...[_4_1, _4_2, root4]);





    const root5 = new metadata_fields({
        "definition": "",
        "label": "გეოგრაფიული მდებარეობა",
        "note": "",
        "num": "5",
        "isRequired": "",
        "sample": "",
        "fieldType": "TREE_FIELD"
    });
    const _5_1 = new metadata_fields({
        "definition": "რესურსის გეოგრაფიული მდებარეობა. მონაცემთა ნაკრების გავრცელების არეალის საზღვრის ყველაზე უკიდურესი დასავლეთ გრძედი გამოხატული ათწილად გრადუსებში (პოზიტიური აღმოსავლეთი). მონაცემთა ნაკრების გავრცელების არეალის საზღვრის ყველაზე უკიდურესი აღმოსავლეთ გრძედი გამოხატული ათწილად გრადუსებში (პოზიტიური აღმოსავლეთი). მონაცემთა ნაკრების გავრცელების არეალის საზღვრის ყველაზე უკიდურესი ჩრდილოეთ განედი გამოხატული ათწილად გრადუსებში (პოზიტიური ჩრდილოეთი). მონაცემთა ნაკრების გავრცელების არეალის საზღვრის ყველაზე უკიდურესი სამხრეთ განედი გამოხატული ათწილად გრადუსებში (პოზიტიური ჩრდილოეთი).",
        "label": "გეოგრაფიული საზღვრების ჩარჩო",
        "note": "გეოგრაფიული საზღვრების ჩარჩო უნდა იყოს რაც შეიძლება პატარა ზომის. გეოგრაფიული საზღვრების ჩარჩო წარმოდგენილი უნდა იყოს ათწილად გრადუსებში მძიმის შემდეგ მინიმუმ 2 ათწილადი ციფრის სიზუსტით.",
        "num": "5.1",
        "isRequired": "1",
        "sample": "44.60 (westBoundLongitude) 45.02 (eastBoundLongitude) 41.62 (southBoundLatitude)",
        "fieldType": "TEXT_FIELD"
    });
    const _5_2 = new metadata_fields({
        "definition": "რესურსის გეოგრაფიულ სივრცეში მდებარეობის მოკლე, მკაფიო და მარტივი ტექსტური აღწერა.",
        "label": "გეოგრაფიული არეალის ტექსტური აღწერა",
        "note": "",
        "num": "5.2",
        "isRequired": "1",
        "sample": "მონაცემები ფარავს საქართველოს ტერიტორიის 70%-ს.",
        "fieldType": "TEXT_FIELD"
    });

    root5.children = [_5_1, _5_2];

    allNodesFromBottom.push(...[_5_1, _5_2, root5]);




    const root6 = new metadata_fields({
        "definition": "",
        "label": "დროითი სარეფერენციო სისტემა",
        "note": "",
        "num": "6",
        "isRequired": "",
        "sample": "",
        "fieldType": "TREE_FIELD"
    });
    const _6_1 = new metadata_fields({
        "definition": "რესურსის მიერ მოცული დროის პერიოდი.",
        "label": "დროითი პერიოდი",
        "note": "დროითი პერიოდი, პირველ რიგში, ეხება მონაცემთა შეგროვების პერიოდს. თუმცა, თუ მონაცემთა რესურსი ეხება ისტორიულ პერიოდს, როგორიც არის გეოლოგიური პერიოდი, ამ შემთხვევაში, დროითი პერიოდი შეეხება იმ მომენტს, როდესაც მონაცემები აღმოჩენილ იქნა ან შეგროვდა. დროითი პერიოდი განისაზღვრება დაწყებისა და დასრულების თარიღით ან ერთ-ერთი მათგანით. თუ საწყისი თარიღი არ არის ცნობილი, იგი უნდა იქნეს გამოტოვებული და მიეთითება მხოლოდ დასრულების თარიღი. თუ მონაცემები ემატება რესურსს, გამოტოვებულ უნდა იქნას დასრულების თარიღი, თუმცა, მიეთითება საწყისი თარიღი, რომელიც ასევე აისახება მონაცემთა სტატუსში, როგორც განახლება.",
        "num": "6.1",
        "isRequired": "1",
        "sample": "2008-03-10 დან 2011-01-15 მდე",
        "fieldType": "TIME_FIELD_REPEATABLE"
    });
    const _6_2 = new metadata_fields({
        "definition": "",
        "label": "სარეფერენციო თარიღი",
        "note": "",
        "num": "6.2",
        "isRequired": "",
        "sample": "",
        "fieldType": "TREE_FIELD"
    });

    const _6_2_1 = new metadata_fields({
        "definition": "სარეფერენციო თარიღი მითითებული რესურსისთვის.",
        "label": "სარეფერენციო თარიღი: კონკრეტული თარიღი",
        "note": "თარიღი შედგება წლის, თვისა და დღის მნიშვნელობებისაგან, რომლებიც მოცემული უნდა იყოს სსტ ისო 19108:2002/2014 და სსტ ისო 8601:2004/2014 სტანდარტებით განსაზღვრულ ფორმატში.",
        "num": "6.2.1",
        "isRequired": "1",
        "sample": "1921; 2007-09; 2015-04-25",
        "fieldType": "TIME_FIELD_REPEATABLE"
    });
    const _6_2_2 = new metadata_fields({
        "definition": "რესურსის მითითებულ სარეფერენციო თარიღთან დაკავშირებული მოვლენა.",
        "label": "სარეფერენციო თარიღი: თარიღის ტიპი",
        "note": "თარიღის ტიპი განკუთვნილია შექმნის თარიღის, გამოქვეყნების თარიღის ან საბოლოო ვერსიის თარიღის გამიჯვნისთვის.",
        "num": "6.2.2",
        "isRequired": "1",
        "sample": "გამოქვეყნება",
        "fieldType": "SELECT_FIELD_REPEATABLE"
    });

    _6_2.children = [_6_2_1, _6_2_2];





    const _6_3 = new metadata_fields({
        "definition": "რესურსის ჩამოყალიბების შემდგომ, მასში ცვლილებების და განახლებების შეტანის სიხშირე და პერიოდულობა.",
        "label": "განახლების სიხშირე",
        "note": "ეს ელემენტი ახორციელებს მონაცემთა რესურსის გადამოწმების სიხშირის დოკუმენტირებას.",
        "num": "6.3",
        "isRequired": "1",
        "sample": "პერიოდული",
        "fieldType": "SELECT_FIELD"
    });
    const _6_4 = new metadata_fields({
        "definition": "ინფორმაცია რესურსის მოვლა-შენარჩუნებასთან დაკავშირებული კონკრეტული მოთხოვნების შესახებ.",
        "label": "ინფორმაცია განახლების შესახებ",
        "note": "ელემენტით დოკუმენტირებულია მონაცემთა განახლების შესახებ დამატებითი ინფორმაცია.",
        "num": "6.4",
        "isRequired": "1",
        "sample": "მონაცემთა განახლება ხორციელდება თვის პირველ რიცხვში.",
        "fieldType": "TEXT_FIELD"
    });
    root6.children = [_6_1, _6_2, _6_3, _6_4];
    allNodesFromBottom.push(...[_6_2_1, _6_2_2,_6_1, _6_2, _6_3, _6_4]);



    const root7 = new metadata_fields({
        "definition": "",
        "label": "ხარისხი და ვალიდურობა",
        "note": "",
        "num": "7",
        "isRequired": "",
        "sample": "",
        "fieldType": "TREE_FIELD"
    });
    const _7_1 = new metadata_fields({
        "definition": "ინფორმაცია სივრცითი მონაცემების ნაკრებთან დაკავშირებული პროცესების ისტორიის ან/და მთლიანობაში მონაცემთა ნაკრების ხარისხის შესახებ. საჭიროების შემთხვევაში, მასში შესაძლებელია მოცემული იყოს ინფორმაცია მონაცემების ნაკრების დამტკიცების, მისი ხარისხის, ოფიციალური ვერსიის არსებობის (რამდენიმე ვერსიის არსებობის შემთხვევაში) და მონაცემების სამართლებრივი სტატუსის შესახებ.",
        "label": "წარმოშობა",
        "note": "მწარმოებლის მიერ მოცემული ზოგადი აღწერილობა მონაცემთა შეგროვების ისტორიის შესახებ.",
        "num": "7.1",
        "isRequired": "1",
        "sample": "ტოპონიმები (გეოგრაფიული ობიექტების სახელწოდებები ) შექმნილია 1:50000 მასშტაბის ტოპოგრაფიული რუკებიდან და კორექტირებულია ორთოფოტოს საფუძველზე. ტოპონიმების განახლება/კორექტირება ხორციელდება სხვადასხვა ოფიციალურ (გეოგრაფიული ობიექტების სახელწოდებათა დადგენის, ნორმალიზების, გამოყენების, აღრიცხვისა და დაცვის სამთავრობო კომისიის) წყაროებზე და სამეცნიერო ლიტერატურაზე (დიდი საბჭოთა ენციკლოპედია; საქართველოს გეოგრაფიული სახელების ორთოგრაფიული ლექსიკონი) დაყრდნობით. გამოქვეყნებამდე მონაცემები გადიან გეომეტრიულ, ატრიბუტულ, ლოგიკურ და ტოპოლოგიური ხარისხის კონტროლს.",
        "fieldType": "TEXTAREA"
    });
    const _7_2 = new metadata_fields({
        "definition": "რესურსის გეოგრაფიული მონაცემების გამოსახვის მეთოდი (ფორმატი).",
        "label": "სივრცითი გამოსახვის ტიპი",
        "note": "",
        "num": "7.2",
        "isRequired": "1",
        "sample": "ვექტორი",
        "fieldType": "SELECT_FIELD"
    });
    const _7_3 = new metadata_fields({
        "definition": "",
        "label": "სივრცითი რეზოლუცია",
        "note": "",
        "num": "7.3",
        "isRequired": "",
        "sample": "",
        "fieldType": "TREE_FIELD"
    })

    const _7_3_1 = new metadata_fields({
        "definition": "მონაცემების დეტალიზაციის დონე, რომელიც გამოისახება მასშტაბის მაჩვენებლით.",
        "label": "სივრცითი რეზოლუცია: მასშტაბი",
        "note": "სივრცითი რეზოლუცია, მასშტაბი ყველაზე ხშირად გამოიყენება რუკებისა და რუკების საფუძველზე შექმნილი პროდუქტებისთვის. როგორც წესი, ეს არის რუკის მასშტაბის საზომი დადებითი, მთელი რიცხვითი მნიშვნელობა. 1:1 000-იანი მასშტაბის რუკისთვის ელემენტის მნიშვნელობა იქნება - 1 000. თუ მოცემულია ორი მნიშვნელობა, სივრცითი რეზოლუცია შეზღუდულია ამ ორი მნიშვნელობით. მაგალითად, ,,25 000, 50 000“ განსაზღვრავს სივრიცითი რეზოლუციის ინტერვალს 1:25 000 და 1:50000-იან მასშტაბებს შორის. თუ, მონაცემებს გააჩნია მასშტაბის რამდენიმე ინტერვალი, აღინიშნება ყველაზე მცირე მასშტაბი.",
        "num": "7.3.1",
        "isRequired": "1",
        "sample": "50000 (მაგ. 1:50 000 მასშტაბის რუკა)",
        "fieldType": "SELECT_FIELD_RECOMMENDED"
    });
    const _7_3_2 = new metadata_fields({
        "definition": "ფაქტობრივი მანძილი ორ მეზობელ წერტილს შორის.",
        "label": "სივრცითი რეზოლუცია: მანძილი",
        "note": "ISO 19119-ის მიხედვით, სერვისებისთვის არ არის შესაძლებელი სივრცით რეზოლუციასთან დაკავშირებული სერვისის შეზღუდვა. სერვისებისთვის სივრცითი რეზოლუციის შეზღუდვა აღიწერება რესურსის მოკლე მიმოხილვაში.",
        "num": "7.3.2",
        "isRequired": "0",
        "sample": "100 (მეტრი)",
        "fieldType": "SELECT_FIELD_RECOMMENDED"
    });

    _7_3.children = [_7_3_1, _7_3_2];
    root7.children = [_7_1, _7_2, _7_3];

    allNodesFromBottom.push(...[_7_3_1, _7_3_2,_7_1, _7_2, _7_3])




    const root8 = new metadata_fields({
        "definition": "",
        "label": "შესაბამისობა",
        "note": "",
        "num": "8",
        "isRequired": "",
        "sample": "",
        "fieldType": "TREE_FIELD"
    });
    const _8_1 = new metadata_fields({
        "definition": "",
        "label": "შესაბამისობა სპეციფიკაციასთან",
        "note": "",
        "num": "8.1",
        "isRequired": "",
        "sample": "",
        "fieldType": "TREE_FIELD"
    })
    const arr_8_1 = [];
    arr_8_1.push(new metadata_fields({
        "definition": "შესაბამისობის შეფასების შედეგის მითითება.",
        "label": "შესაბამისობა სპეციფიკაციასთან: ინდიკატორი",
        "note": "",
        "num": "8.1.1",
        "isRequired": "1",
        "sample": "დიახ",
        "fieldType": "CHECKBOX"
    }));
    arr_8_1.push(new metadata_fields({
        "definition": "იმ მარეგულირებელი წეს(ებ)ისა ან/და სხვა დოკუმენტ(ებ)ის სახელწოდება, რომლის (რომელთა) მეშვეობითაც ხორციელდება სივრცითი მონაცემების ჰარმონიზაცია.",
        "label": "შესაბამისობა სპეციფიკაციასთან: სახელწოდება",
        "note": "ეს ელემენტი განსაზღვრავს იმ რეგულაციებს, სპეციფიკაციებსა და სხვა აქტებს, რომლებიც გამოიყენება მონაცემთა რესურსის შესაბამისობის შემოწმებისას. რესურსი შესაძლოა შეესაბამებოდეს რამდენიმე დოკუმენტს.",
        "num": "8.1.2",
        "isRequired": "1",
        "sample": "გეოგრაფიული ობიექტების სახელწოდებების მონაცემთა სპეციფიკაცია - ვერსია 1.0.1.",
        "fieldType": "TEXT_FIELD_REPEATABLE"
    }));
    arr_8_1.push(new metadata_fields({
        "definition": "იმ მარეგულირებელი წეს(ებ)ისა ან/და სხვა დოკუმენტ(ებ)ის საცნობარო თარიღი, რომლის (რომელთა) მეშვეობითაც ხორციელდება სივრცითი მონაცემების ჰარმონიზაცია.",
        "label": "შესაბამისობა სპეციფიკაციასთან: თარიღი",
        "note": "თარიღი განისაზღვრება სსტ ისო 19108:2002/2014 და სსტ ისო 8601:2004/2014 სტანდარტებით.",
        "num": "8.1.3",
        "isRequired": "1",
        "sample": "2007-09; 2015-04-25",
        "fieldType": "TIME_FIELD_REPEATABLE"
    }));
    arr_8_1.push(new metadata_fields({
        "definition": "ციტირებული სპეციფიკაციის საცნობარო თარიღთან დაკავშირებული მოვლენა.",
        "label": "შესაბამისობა სპეციფიკაციასთან: თარიღის ტიპი",
        "note": "",
        "num": "8.1.4",
        "isRequired": "1",
        "sample": "გამოქვეყნება",
        "fieldType": "SELECT_FIELD_REPEATABLE"
    }));
    _8_1.children = arr_8_1;
    allNodesFromBottom.push(...arr_8_1);



    const _8_2 = new metadata_fields({
        "definition": "რესურსის შესაბამისობის შეფასების შედეგის მოკლე და მკაფიო ტექსტური აღწერა.",
        "label": "შესაბამისობის აღწერა",
        "note": "",
        "num": "8.2",
        "isRequired": "1",
        "sample": "ციტირებულ სპეციფიკაციასთან მონაცემთა რესურსის შესაბამისობის შემოწმებისას გამოიყენება მხოლოდ სავალდებულო ელემენტები.",
        "fieldType": "TEXTAREA"
    });
    root8.children = [_8_1, _8_2];
    allNodesFromBottom.push(...[_8_1, _8_2]);




    const root9 = new metadata_fields({
        "definition": "",
        "label": "წვდომასა და გამოყენებასთან დაკავშირებული პირობები და შეზღუდვები",
        "note": "",
        "num": "9",
        "isRequired": "",
        "sample": "",
        "fieldType": "TREE_FIELD"
    });
    const arr_9 = [];
    arr_9.push(new metadata_fields({
        "definition": "წვდომის შეზღუდვა, რომელიც მოქმედებს პირადი ცხოვრების ხელშეუხებლობის, ინტელექტუალური საკუთრების უფლების დაცვის მიზნით ან/და რესურსების გამოყენებასთან დაკავშირებით მოქმედი სხვა სპეციალური აკრძალვები ან/და შეზღუდვები.",
        "label": "საჯარო წვდომის შეზღუდვები - წვდომის შეზღუდვა",
        "note": "",
        "num": "9.1",
        "isRequired": "1",
        "sample": "სხვა აკრძალვები (შეზღდუვები არ არის ჩამოთვლილი).",
        "fieldType": "SELECT_FIELD_REPEATABLE"
    }));
    arr_9.push(new metadata_fields({
        "definition": "რესურსის ან მეტამონაცემების გამოყენებასა და წვდომასთან დაკავშირებული სხვა შეზღუდვები და სამართლებრივი წინაპირობები.",
        "label": "საჯარო წვდომის შეზღუდვები - სხვა შეზღუდვები",
        "note": "",
        "num": "9.2",
        "isRequired": "0",
        "sample": "არ მოქმედებს შეზღდუვები",
        "fieldType": "TEXTAREA_REPEATABLE"
    }));
    arr_9.push(new metadata_fields({
        "definition": "რესურსზე მოქმედი შეზღუდვის კატეგორია, რომელიც დაფუძნებულია კლასიფიკაციის საერთო სისტემაზე.",
        "label": "საჯარო წვდომის შეზღუდვები – კლასიფიკაცია",
        "note": "შეზღუდვების კლასიფიკაცია დაფუძნებულია კლასიფიკაციის საერთო სისტემაზე სტანდარტიზაციის საერთაშორისო ორგანიზაციის სტანდარტის (ISO) 19115-ის შესაბამისად.",
        "num": "9.3",
        "isRequired": "1",
        "sample": "არაკლასიფიცირებული",
        "fieldType": "SELECT_FIELD"
    }));
    arr_9.push(new metadata_fields({
        "definition": "შეზუდვები რესურსის ან მეტამონაცემების წვდომასა და გამოყენებაზე.",
        "label": "წვდომასა და გამოყენებასთან დაკავშირებული პირობები და შეზღუდვები",
        "note": "პირობები, რომელიც ახდენს გავლენას რესურსის გამოყენებაზე.",
        "num": "9.4",
        "isRequired": "0",
        "sample": "კომერციული მიზნით გამოყენება აკრძალულია",
        "fieldType": "TEXTAREA_REPEATABLE"
    }));
    root9.children = arr_9;

    allNodesFromBottom.push(...arr_9);
    allNodesFromBottom.push(root9);

    const root10 = new metadata_fields({
        "definition": "",
        "label": "სივრცითი მონაცემების ნაკრებების და სივრცით მონაცემებთან დაკავშირებული ელექტრონული სერვისების შექმნაზე, მართვასა და დისტრიბუციაზე პასუხისმგებელი მხარე",
        "note": "",
        "num": "10",
        "isRequired": "",
        "sample": "",
        "fieldType": "TREE_FIELD_REPEATABLE_INSIDE"
    });
    const arr_10 = [];
    arr_10.push(new metadata_fields({
        "definition": "რესურს(ებ)თან დაკავშირებული ორგანიზაციის დასახელება კომუნიკაციის მიზნით.",
        "label": "რესურსზე პასუხისმგებელი მხარე: ორგანიზაციის სახელწოდება",
        "note": "ორგანიზაციის სახელწოდება უნდა იყოს მოცემული სრულად, აბრივიატურის გარეშე.",
        "num": "10.1",
        "isRequired": "1",
        "sample": "სსიპ - საჯარო რეესტრის ეროვნული სააგენტო",
        "fieldType": "TEXT_FIELD"
    }));
    arr_10.push(new metadata_fields({
        "definition": "კომუნიკაციის მიზნით, რესურსთან დაკავშირებული უფლებამოსილი პირ(ებ)ის სახელი და გვარი.",
        "label": "რესურსზე პასუხისმგებელი მხარე: უფლებამოსილი პირი",
        "note": "",
        "num": "10.2",
        "isRequired": "1",
        "sample": "კვაჭი კვაჭანტირაძე",
        "fieldType": "TEXT_FIELD"
    }));
    arr_10.push(new metadata_fields({
        "definition": "პასუხისმგებელი ორგანიზაციის ან უფლებამოსილი პირის ელექტრონული ფოსტის მისამართი.",
        "label": "რესურსზე პასუხისმგებელი მხარე: საკონტაქტო ინფორმაცია",
        "note": "რეკომენდებულია ინსტიტუციური ელექტრონული ფოსტის გამოყენება პირადი ელექტრონული ფოსტის მაგივრად.",
        "num": "10.3",
        "isRequired": "1",
        "sample": "info@napr.gov.ge",
        "fieldType": "TEXT_FIELD"
    }));
    arr_10.push(new metadata_fields({
        "definition": "ფუნქცია, რომელსაც ასრულებს პასუხისმგებელი მხარე.",
        "label": "რესურსზე პასუხისმგებელი მხარე: როლი",
        "note": "თუ მეტამონაცემების ჩანაწერებში როლები და ვალდებულებები გვხვდება სხვადასხვა კონტექსტში და სხვადასხვა მნიშვნელობებით, მნიშნელოვანია, რომ არ აირიოს ისინი.",
        "num": "10.4",
        "isRequired": "1",
        "sample": "მესაკუთრე",
        "fieldType": "SELECT_FIELD"
    }));

    root10.children = arr_10;
    allNodesFromBottom.push(...arr_10);
    allNodesFromBottom.push(root10);



    const root11 = new metadata_fields({
        "definition": "",
        "label": "მეტამონაცემები მეტამონაცემების შესახებ",
        "note": "",
        "num": "11",
        "isRequired": "",
        "sample": "",
        "fieldType": "TREE_FIELD"
    });

    const arr_11 = [];
    const _11_1 = []
    arr_11.push(new metadata_fields({
        "definition": "",
        "label": "მეტამონაცემების სტანდარტი",
        "note": "",
        "num": "11.1",
        "isRequired": "",
        "sample": "",
        "fieldType": "TREE_FIELD"
    }));



    _11_1.push(new metadata_fields({
        "definition": "მეტამონაცემების იმ სტანდარტის სახელწოდება, რომელსაც შეესაბამება მეტამონაცემები.",
        "label": "მეტამონაცემების სტანდარტის სახელწოდება",
        "note": "რეგისტრირებული სტანდარტის ოფიციალური დასახელება.",
        "num": "11.1.1",
        "isRequired": "1",
        "sample": "GeoNSDI_MD_v1.1_20160615",
        "fieldType": "TEXT_FIELD"
    }),
        new metadata_fields({
            "definition": "მითითებული სტანდარტის ვერსია, რომელსაც შეესაბამება მეტამონაცემები.",
            "label": "მეტამონაცემების სტანდარტის ვერსია",
            "note": "",
            "num": "11.1.2",
            "isRequired": "1",
            "sample": "1.1",
            "fieldType": "TEXT_FIELD"
        }));

    arr_11[0].children = _11_1;

    arr_11.push(new metadata_fields({
        "definition": "მეტამონაცემების შექნის ან განახლების თარიღი.",
        "label": "მეტამონაცემების თარიღი",
        "note": "მეტამონაცემების განახლების ან საბოლოო განახლების ან თუ მეტამონაცემები არ განახლებულა, მისი შექმნის თარიღი. თარიღი განისაზღვრება სსტ ისო 19108:2002/2014 და სსტ ისო 8601:2004/2014 სტანდარტებით.",
        "num": "11.2",
        "isRequired": "1",
        "sample": "42119",
        "fieldType": "TIME_FIELD"
    }));
    arr_11.push(new metadata_fields({
        "definition": "მეტამონაცემების დოკუმენტირებისას გამოყენებული ენა.",
        "label": "მეტამონაცემების ენა",
        "note": "გამოიყენება მხოლოდ ენის სამსიმბოლოიანი ბიბლიოგრაფიული კოდები სსტ ისო 639-2:1998/2014 სტანდარტის მიხედვით.",
        "num": "11.3",
        "isRequired": "1",
        "sample": "ქართული",
        "fieldType": "SELECT_FIELD"
    }));
    arr_11.push(new metadata_fields({
        "definition": "კოდი, რომელიც არის მეტამონაცემების უნიკალური იდენტიფიკატორი.",
        "label": "მეტამონაცემების იდენტიფიკატორი",
        "note": "ორგანიზაციის სახელწოდება უნდა იყოს მოცემული სრულად, აბრივიატურის გარეშე. რეკომენდებულია ინსტიტუციური ელექტრონული ფოსტის გამოყენება პირადი ელექტრონული ფოსტის მაგივრად.",
        "num": "11.4",
        "isRequired": "1",
        "sample": "",
        "fieldType": "TEXT_FIELD"
    }));
    arr_11.push(new metadata_fields({
        "definition": "",
        "label": "მეტამონაცემებზე პასუხისმგებელი მხარე",
        "note": "",
        "num": "11.5",
        "isRequired": "",
        "sample": "",
        "fieldType": "TREE_FIELD_REPEATABLE_INSIDE"
    }));

    const _11_5 = []
    _11_5.push(...[
        new metadata_fields({
            "definition": "მეტამონაცემებზე პასუხისმგებელი ორგანიზაციის დასახელება.",
            "label": "მეტამონაცემებზე პასუხისმგებელი მხარე: ორგანიზაციის სახელწოდება",
            "note": "ორგანიზაციის სახელწოდება უნდა იყოს მოცემული სრულად, აბრივიატურის გარეშე. რეკომენდებულია ინსტიტუციური ელექტრონული ფოსტის გამოყენება პირადი ელექტრონული ფოსტის მაგივრად.",
            "num": "11.5.1",
            "isRequired": "1",
            "sample": "სსიპ - საჯარო რეესტრის ეროვნული სააგენტო",
            "fieldType": "TEXT_FIELD"
        }),
        new metadata_fields({
            "definition": "მეტამონაცემებზე პასუხისმგებელი უფლებამოსილი პირის სახელი და გვარი.",
            "label": "მეტამონაცემებზე პასუხისმგებელი მხარე: უფლებამოსილი პირი",
            "note": "",
            "num": "11.5.2",
            "isRequired": "1",
            "sample": "კვაჭი კვაჭანტირაძე",
            "fieldType": "TEXT_FIELD"
        }),
        new metadata_fields({
            "definition": "პასუხისმგებელი ორგანიზაციისა ან უფლებამოსილი პირის ელექტრონული ფოსტის მისამართი.",
            "label": "მეტამონაცემებზე პასუხისმგებელი მხარე: საკონტაქტო ინფორმაცია",
            "note": "რეკომენდებულია, ინსტიტუციური ელექტრონული ფოსტის გამოყენება პირადი ელექტრონული ფოსტის მაგიერ.",
            "num": "11.5.3",
            "isRequired": "1",
            "sample": "info@napr.gov.ge",
            "fieldType": "TEXT_FIELD"
        }),
        new metadata_fields({
            "definition": "მეტამონაცემებზე პასუხისმგებელი მხარის მიერ შესრულებული ფუნქცია.",
            "label": "მეტამონაცემებზე პასუხისმგებელი მხარე: როლი",
            "note": "მეტამონაცემების ჩანაწერში როლი და პასუხისმგებლობა გამოიყენება სხვადასხვა კონტექსტში. მნიშვნელოვანია, რომ არ მოხდეს მათი აღრევა.",
            "num": "11.5.4",
            "isRequired": "1",
            "sample": "მესაკუთრე",
            "fieldType": "SELECT_FIELD"
        })]);


    arr_11[arr_11.length-1].children = _11_5

    root11.children = arr_11;

    allNodesFromBottom.push(..._11_1)
    allNodesFromBottom.push(..._11_5)
    allNodesFromBottom.push(...arr_11);
    allNodesFromBottom.push(root11);


    //_1_9_children.concat(_1_10_children,root1_immidiate_children, root1,)


    const saveSequentially = async () => {

        let index = 1;
        for (const item of allNodesFromBottom) {
            item.sort = index;
            try {
                await item.save();
            }catch (e) {
                console.log("this is error",e, item)
            }

            index++;
        }
        res.send("this is sparta");

    }

    const result = saveSequentially();


}




